hirokuma/nrf51822_templete/main.c
    //I/O Service
    ble_ios_on_ble_evt(&m_ios, p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    app_error_handler(DEAD_BEEF, 0, NULL);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_4000MS_CALIBRATION, true);

    // Enable BLE stack
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for System events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function for handling a button event.
 *
 * @param[in]   pin_no         Pin that had an event happen.
 * @param[in]   button_event   APP_BUTTON_PUSH or APP_BUTTON_RELEASE.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_event)
{
    uint32_t err_code = NRF_SUCCESS;
    uint8_t value;

    switch (pin_no) {
    case BUTTON_PIN_NO_APP:
        if (button_event == APP_BUTTON_PUSH) {
            value = 0x80;
        }
        else {
            value = 0x00;
        }
        err_code = ble_ios_on_output(&m_ios, value);
        if ((err_code != NRF_SUCCESS) &&
          (err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&
          (err_code != NRF_ERROR_INVALID_STATE)) {
            APP_ERROR_CHECK(err_code);
        }
        break;


    default:
        APP_ERROR_HANDLER(pin_no);
        break;
    }

}

/**@brief Function for initializing the GPIOTE handler module.
 */
static void gpiote_init(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}


/**@brief Function for initializing the button handler module.
 *
 * @note    初期化しただけではボタンを使用できない。
 *          使用する場合はapp_button_enable()を呼び出すこと。
 */
static void buttons_init(void)
{
    // Note: Array must be static because a pointer to it will be saved in the Button handler
    //       module.
    static app_button_cfg_t buttons[] = {
        { BUTTON_PIN_NO_APP, APP_BUTTON_ACTIVE_LOW, BUTTON_PULL, button_event_handler },
    };

    APP_BUTTON_INIT(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY, true);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize
    leds_init();
    timers_init();
    gpiote_init();
    buttons_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    sec_params_init();

    // Start execution
    timers_start();
    advertising_start();

    // Enter main loop
    for (;;) {
        app_sched_execute();
        power_manage();
    }
}

/**
 * @}
 */
